wcheng95/MiniShell/platform/adv/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The resident MiniShell runtime/shell executes on ESP-IDF's main task. Keep
# enough stack for shell/backend call depth; foreground applications run on a
# separate ADV-managed application task and do not borrow this stack.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Fail clearly on future task-stack exhaustion instead of allowing silent
# memory corruption to turn into an unrelated exception.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# ESP32-S3 defaults to a 32 KiB data cache. The special 16 KiB mode keeps the
# hardware cache configured at 32 KiB but makes another 16 KiB of internal SRAM
# available to the heap. Keep the default 16 KiB instruction cache unchanged.
# This is intentionally isolated as a RAM/performance experiment: validate FT8
# decode timing before making it part of the permanent ADV configuration.
CONFIG_ESP32S3_DATA_CACHE_16KB=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set

# Both ADV storage volumes use FATFS: /flash is internal SPI flash through the
# ESP-IDF wear-levelling layer and /sd is removable FATFS over SDSPI. MiniShell's
# Filesystem contract allows names up to MINI_FS_NAME_MAX (255), so enable long
# filenames explicitly. Heap-backed LFN avoids consuming resident/app task
# stack, and UTF-8 keeps VFS filename representation compatible with the
# byte-string MiniShell API.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y

# ESP-IDF defaults to a separate sector cache in every FATFS FIL object. With
# eight file slots per mounted volume this consumes tens of KiB of resident RAM
# even when no files are open. MiniShell normally has only a few active files
# and ADV-WAV streams a single file, so use FatFs tiny mode/shared sector cache
# instead. This trades some multi-file I/O performance for much lower idle RAM.
# CONFIG_FATFS_PER_FILE_CACHE is not set

# usbmsc temporarily hands the ESP32-S3 USB device peripheral and raw FAT media
# to TinyUSB. Keep the MSC transfer buffer at 4096 bytes so it is large enough
# for the existing /flash wear-levelling sector without changing the validated
# FATFS/wear-levelling storage format.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096
